; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_1 ?v1 - type_2 ?v6 - type_1)
 	      (pred_3 ?v3 - object ?v6 - type_1)
	      (pred_4 ?v1 - type_2 ?v2 - type_3)
	      (pred_2 ?v1 - type_2 ?v3 - object ?v2 - type_3))

   (:action op_2
       :parameters  (?v1 - type_2 ?v7 ?v8 - type_1)
       :precondition (and  (pred_1 ?v1 ?v7))
       :effect (and  (pred_1 ?v1 ?v8)
		     (not (pred_1 ?v1 ?v7))))

   (:action op_1
       :parameters (?v1 - type_2 ?v5 - object ?v4 - type_1 ?v2 - type_3)
       :precondition  (and  (pred_3 ?v5 ?v4) (pred_1 ?v1 ?v4) (pred_4 ?v1 ?v2))
       :effect (and (pred_2 ?v1 ?v5 ?v2)
		    (not (pred_3 ?v5 ?v4)) 
		    (not (pred_4 ?v1 ?v2))))

   (:action op_3
       :parameters (?v1 - type_2 ?v5 - object ?v4 - type_1 ?v2 - type_3)
       :precondition  (and  (pred_2 ?v1 ?v5 ?v2) (pred_1 ?v1 ?v4))
       :effect (and (pred_3 ?v5 ?v4)
		    (pred_4 ?v1 ?v2)
		    (not (pred_2 ?v1 ?v5 ?v2)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_06 - type_2
obj_07 obj_09 - type_3
obj_02 obj_04 obj_03 obj_05 - type_1
obj_08 obj_01 obj_10 - object)
(:init
(pred_1 obj_06 obj_04)
(pred_4 obj_06 obj_07)
(pred_4 obj_06 obj_09)
(pred_3 obj_08 obj_04)
(pred_3 obj_01 obj_02)
(pred_3 obj_10 obj_04)
)
(:goal
(and
(pred_3 obj_08 obj_02)
(pred_3 obj_01 obj_04)
(pred_3 obj_10 obj_04)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_2 obj_06 ?b obj_09))))
)
)

; plan
1. (op_1 obj_06 obj_08 obj_04 obj_07)
   deleted: (pred_3 obj_08 obj_04) (pred_4 obj_06 obj_07)
   added: (pred_2 obj_06 obj_08 obj_07)
   goals met: 1 of 3
2. (op_2 obj_06 obj_04 obj_02)
   deleted: (pred_1 obj_06 obj_04)
   added: (pred_1 obj_06 obj_02)
   goals met: 1 of 3
3. (op_3 obj_06 obj_08 obj_02 obj_07)
   deleted: (pred_2 obj_06 obj_08 obj_07)
   added: (pred_3 obj_08 obj_02) (pred_4 obj_06 obj_07)
   goals met: 2 of 3
4. (op_1 obj_06 obj_01 obj_02 obj_07)
   deleted: (pred_3 obj_01 obj_02) (pred_4 obj_06 obj_07)
   added: (pred_2 obj_06 obj_01 obj_07)
   goals met: 2 of 3
5. (op_2 obj_06 obj_02 obj_04)
   deleted: (pred_1 obj_06 obj_02)
   added: (pred_1 obj_06 obj_04)
   goals met: 2 of 3
6. (op_3 obj_06 obj_01 obj_04 obj_07)
   deleted: (pred_2 obj_06 obj_01 obj_07)
   added: (pred_3 obj_01 obj_04) (pred_4 obj_06 obj_07)
   goals met: 3 of 3
